using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ChemColud.Shipping
{
    public class FedexCommon
    {
        public static readonly Dictionary<string, string> _errorCodes = new Dictionary<string, string>
        {
            {"1000", "一般故障"},
            {"1001", "服务发出异常回复"},
            {"1003", "信息已默认设为处理此请求"},
            {"1004", "标准隔夜联邦快递"},
            {"2000", "streetLine 1 无效"},
            {"2001", "countryCode 无效"},
            {"2002", "需要提供一方的地址"},
            {"2003", "需要提供一方的联系人"},
            {"2004", "付款人帐号无效"},
            {"2005", "付款人的 countryCode 无效"},
            {"2006", "包裹重量超出请求服务/包装的最大值"},
            {"2007", "包裹重量小于请求服务/包装的最小值"},
            {"2008", "关税支付类型对非加拿大国内、非文件的国际货件无效"},
            {"2009", "关税支付类型与目的地国家/地区的支付类型不兼容"},
            {"2010", "目的地国家/地区未启用热敏空运提单"},
            {"2011", "目的地国家/地区代码无效"},
            {"2012", "寄件人或始发地国家/地区未启用热敏空运提单"},
            {"2013", "始发地或寄件人国家/地区代码无效"},
            {"2014", "不支持从指定的始发地国家/地区发送货件到叙利亚"},
            {"2015", "该始发地或目的地国家/地区不支持国内服务"},
            {"2016", "加拿大国内货件必须使用加拿大元作为首选货币"},
            {"2017", "包裹 {PACKAGE_INDEX} 托运申报价值超过加拿大国内托运的最大申报价值"},
            {"2018", "加拿大国内货件必须使用加拿大元作为托运申报价值货币"},
            {"2019", "客户端详细信息中缺少帐号"},
            {"2020", "客户端详细信息中缺少 Meter 号"},
            {"2021", "包裹数量或包裹序列号无效"},
            {"2021", "包裹数量或包裹序列号无效"},
            {"2021", "包裹数量或包裹序列号无效"},
            {"2021", "包裹数量或包裹序列号无效"},
            {"2021", "包裹数量或包裹序列号无效"},
            {"2021", "包裹数量或包裹序列号无效"},
            {"2021", "包裹数量或包裹序列号无效"},
            {"2021", "包裹数量或包裹序列号无效"},
            {"2021", "包裹数量或包裹序列号无效"},
            {"2021", "包裹数量或包裹序列号无效"},
            {"2021", "包裹数量或包裹序列号无效"},
            {"2021", "包裹数量或包裹序列号无效"},
            {"2021", "包裹数量或包裹序列号无效"},
            {"2021", "包裹数量或包裹序列号无效"},
        };

    }
}
